src/Catalogs/synс_Methods/synс_Methods.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>synс_Methods</name>
  <owners>Catalog.synс_Services</owners>
  <attributes>
    <name>ИмяHTTPМетода</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>URLСсылкаНаДокументацию</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>350</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Тело</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Версия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ШаблонHTTPМетода</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АдресРесурса</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоАвторизацияПоЛогинуПаролю</name>
    <comment>Вход в систему по логину/паролю</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоАвторизацияПоRefreshToken</name>
    <comment>Повторная авторизация в системе с использованием refresh_token</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИменаПолейДат</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>350</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Заголовки</name>
    <attributes>
      <name>Заголовок</name>
      <type>
        <types>CatalogRef.synс_HeadersHTTP</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/Catalogs/synс_Methods/Forms/ФормаЭлемента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьЗначенияФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	//ЗаполнитьЗначенияФормы();
	
КонецПроцедуры



#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура НаименованиеПриИзменении(Элемент)
	ЗаполнитьАдресРесурса();
КонецПроцедуры

&НаКлиенте
Процедура ВладелецПриИзменении(Элемент)
	ЗаполнитьАдресРесурса();
КонецПроцедуры

&НаКлиенте
Процедура ВерсияПриИзменении(Элемент)
	ЗаполнитьАдресРесурса();
КонецПроцедуры

&НаКлиенте
Процедура ШаблонHTTPМетодаПриИзменении(Элемент)
	ЗаполнитьАдресРесурса();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы_ИмяТаблицы

#КонецОбласти

#Область ОбработчикиКомандФормы

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьЗначенияФормы()
	
	СписокHTTPМетодов = СписокHTTPМетодов();
	
	Для каждого ЗначениеHTTPМетода Из СписокHTTPМетодов Цикл
		Элементы.ИмяHTTPМетода.СписокВыбора.Добавить(ЗначениеHTTPМетода);
	КонецЦикла; 
	
	ЗаполнитьАдресРесурса();
	
КонецПроцедуры

&НаСервере
Функция СписокHTTPМетодов()
	
	//СписокHTTPМетодов = Метаданные.СвойстваОбъектов.HTTPМетод;
	СписокHTTPМетодов = Новый Массив;
	СписокHTTPМетодов.Добавить("GET");
	СписокHTTPМетодов.Добавить("POST");
	СписокHTTPМетодов.Добавить("PATCH");
	СписокHTTPМетодов.Добавить("DELETE");
	СписокHTTPМетодов.Добавить("COPY");
	СписокHTTPМетодов.Добавить("PUT");
	
	Возврат  СписокHTTPМетодов;
	
КонецФункции 


//URLСервиса = СтрШаблон("http://%1/%2/%3/%4", Запись.Сервер, Запись.Версия, СервисКод, Запись.Метод);	
Процедура ЗаполнитьАдресРесурса()
	
	АдресРесурса = "";
	
	МассивПолей = СтрРазделить(Объект.ШаблонHTTPМетода, ",");
	
	КоличествоОграничения = МассивПолей.Количество();
	Сч = 1;
	
	Для каждого ИмяПоля Из МассивПолей Цикл
		
		//Если ИмяПоля = "Сервис" Тогда
		//	Значение = Объект.Владелец;	
		//Если ИмяПоля = "Метод" Тогда
		//	Значение = Объект.Наименование;	
		//Иначе
			Значение = Объект[ИмяПоля];		
		//КонецЕсли; 
		
		ДобавитьСтроку(АдресРесурса, КоличествоОграничения, Значение, Сч, "/");
		
	КонецЦикла; 
	
	Объект.АдресРесурса = АдресРесурса;
	
КонецПроцедуры 

Функция ДобавитьСтроку(ТекстДобавления, КоличествоОграничения, Значение, Сч, Разделитель)
	ТекщийРазделитель = ?(Сч = КоличествоОграничения, "", Разделитель);
	ТекстДобавления = СтрШаблон("%1%2%3", ТекстДобавления, Значение, ТекщийРазделитель);
	Сч = Сч + 1;
КонецФункции 


#КонецОбласти

#Область СлужебныеПроцедурыИФункцииБСП

#КонецОбласти
